// Дані для генерації
const catastrophes = [
  "Ядерна війна. Темна ніч освітлена блискучими вибухами, небо наповнене руйнуванням. Великі міста піддаються атакам ядерних ракет, вулиці вкриті радіаційним пилом. Видимий контур силуетів людей, які шукають укриття від смертоносного вогню. Радіаційне забруднення призводить до раку, вад вродження та інших хвороб. Зруйнована інфраструктура призводить до великої кількості жертв внаслідок відсутності медичної допомоги та евакуації. Люди вимушені шукати притулок в укриттях для виживання.",
  "Глобальне потепління. Розпалений сонцем ландшафт деформується, ріки висихають, запаси прісної води на нулі. Урагани руйнують міста, а екстремальна спека та зливи призводять до катастрофічних повеней. Люди відчайдушно шукають пристань у світі, де немає місця врятування. Екстремальні температури і погодні катаклізми призводять до загибелі людей та втрат в родючості ґрунтів. Зменшення доступу до води та продуктів харчування призводить до конфліктів і боротьби за ресурси. Високий рівень моря затоплює прибережні території, призводячи до масової міграції.",
  "Епідемія. Безлад і паніка у великих містах. Медичні заклади переповнені, а влада намагається зупинити поширення смертоносного вірусу.",
  "Зомбі-апокаліпсис. Зомбі-вірус вибрався із пробірки та почав заражати здорових людей і перетворювати їх на ходячих мерців. Масовий хаос огорнув всю планету. Всі досягнення цивілізації звели нанівець. Виживші будують укриття та змагаються з ордами зомбі.",
  "Повстання роботів. Технологічний прогрес дійшов до людства досяг свого апогею. Створивши роботів, людство створило смертельну небезпеку. Армії роботів ходять містами. Вони перевершують людей як у фізичному розвитку, так і розумовому. Останні люди на планеті почали будувати укриття та розробляти план з повернення планети людству.",
  "Портал з потойбіччя. Невідомі портали почали з'являтися по всій планеті. Фантастичні жахливі створіння почали виходити з порталів та нищити людство.",
  "Відродження динозаврів. Людство спромоглося відродити динозаврів за допомогою їх скелетів та ДНК. Спочатку їх поміщали в спеціально ізольовані вольєри, та коли динозаврів стало дуже багато, вони змогли вибратися з вольєру та вибралися в дику природу.",
];
const rooms = [
  "В бункері є підвал з вином",
  "В бункері є невелика теплиця",
  "В бункері є маленька бібліотека",
  "В бункері є склад продуктів",
  "В бункері є студія звукозапису",
  "В бункері є басейн",
  "В бункері є ринг",
  "В бункері є спортзал",
  "В бункері є запас медикаментів",
];
const conditions = [
  "В бункері водяться миші",
  "В бункері розвелася пліснява",
  "Бункер стоїть під нахилом 10 градусів",
  "В бункері є чорний вхід",
  "Бункер керується штучним інтелектом",
  "В бункері висока вологість",
  "В бункері немає світла",
  "В бункері немає водопостачання",
  "В бункері одна спільна кімната",
  "В бункері немає меблів",
  "В бункері завелися привиди",
  "Бункер має лабіринтоподібну будову",
];
const places = [
  "Бункер знаходиться під Верховною Радою",
  "Бункер знаходиться в болотистій місцевості",
  "Бункер знаходиться на пагорбі",
  "Бункер знаходиться посеред степу",
  "Бункер знаходиться в лісі",
  "Бункер знаходиться в місті",
  "Бункер знаходиться під водою",
  "Бункер вмонтовано в скелю",
];

function getRandomElement(array) {
  return array[Math.floor(Math.random() * array.length)];
}

function generateCondition() {
  const catastrophe = getRandomElement(catastrophes);
  const survivorCount = Math.floor(Math.random() * 10000000);
  const bunkertime = Math.floor(Math.random() * 24);
  const bunkersquare = Math.floor(Math.random() * 150);
  const bunkerroom = getRandomElement(rooms);
  const bunkercondition = getRandomElement(conditions);
  const bunkerplacement = getRandomElement(places);

  const resultElement = `
    <h2>Катастрофа:</h2>
    <p>${catastrophe}</p>
    <p>Вижило ${survivorCount} людей.</p>
    <h2>Бункер:</h2>
    <p>Ваша мета - прожити в бункері ${bunkertime} місяців. В бункері є їжа та питна вода на половину часу перебування. Площа укриття - ${bunkersquare} квадратних метрів. ${bunkerroom}. ${bunkercondition}. ${bunkerplacement}.</p>
    `;
  document.getElementById("result").innerHTML = resultElement;
}
